{
  "_name_or_path": "alimazhar-110/website_classification",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Travel",
    "1": "Social Networking and Messaging",
    "2": "News",
    "3": "Streaming Services",
    "4": "Sports",
    "5": "Photography",
    "6": "Law and Government",
    "7": "Health and Fitness",
    "8": "Games",
    "9": "E-Commerce",
    "10": "Forums",
    "11": "Food",
    "12": "Education",
    "13": "Computers and Technology",
    "14": "Business/Corporate",
    "15": "Adult"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Adult": 15,
    "Business/Corporate": 14,
    "Computers and Technology": 13,
    "E-Commerce": 9,
    "Education": 12,
    "Food": 11,
    "Forums": 10,
    "Games": 8,
    "Health and Fitness": 7,
    "Law and Government": 6,
    "News": 2,
    "Photography": 5,
    "Social Networking and Messaging": 1,
    "Sports": 4,
    "Streaming Services": 3,
    "Travel": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "vocab_size": 30522
}
